test.yml
config:
  target: https://dog.ceo/dog-api/
  phases:
    - duration: 3
      arrivalRate: 3
      name: Artillery First Test
plugins:
  ensure: {}
ensure:
  thresholds:
    - response_time.p95: 3000
    - request_rate: 6
    - response_time.max: 1000
  conditions:
      - expression: vusers.failed == 0
scenarios:
    - name: Getting a resource
      flow:
        - get:
            url: "{{ target }}/get"
            headers:
              User-Agent: "Artillery"
        - post:
            url: "{{ target }}/post"
            json:
            username: "Test User"
            password: "Temp Password"
capture:
    - json: "$.json"
      as: "request_body"
    - json: "$.headers.Host"
      as: "host"
payload:
  path: "./ARTILLERY/keywords.csv"
  fields:
    - username
    - password